{"intents": [
    {"question_type" : "causes",
     "patterns" : ["What are the causes","What may be the causes","why do I suffer from this","why do I suffer from that","What are the reasons","what's the explanation","how did I get this"],
     "responses" : {
        "Abdominal Pain" : "Most commonly, abdominal pain develops without a specific cause. In these cases, doctors cannot diagnose a specific condition. Often the stomach ache can be treated at home and subsides within a few hours. There's a chance that abdominal pain can recur regularly over a period of more than 6 months without any identifiable cause. In that case, it's possible that so-called functional abdominal pain has developed.",
        "Achilles Tendonitis" : "Achilles tendonitis most often occurs when the tendon becomes inflamed or damaged through overuse. Risk factors for developing Achilles tendonitis include: Suddenly increasing the amount or intensity of exercise, not stretching out the calf muscles properly after exercise, running or exercising to excess, running on hard surfaces, jumping repeatedly during exercise or sports, manual labour which puts stress on ankles and feet, having bone spurs (osteophytes) which rub against the Achilles tendon, not wearing sufficiently supportive shoes for exercise and having flattened arches in the foot. ",
        "Acute Aspiration of Oropharyngeal or Gastric Contents" : "The aspiration of oropharyngeal or gastric contents. ",
        "Acute Bronchitis" : "The condition is most commonly caused by a viral infection, often involving the same viruses that cause upper respiratory tract infections such as the common cold and flu. ",
        "Acute Gastritis" : "There are many different causes for acute gastritis: Bacterial Helicobacter pylori infection, taking certain pain medications, such as aspirin or ibuprofen, as well as alcohol and smoking are among the most common ones. ",
        "Acute Heart Failure" : "The heart weakens with age, which particularly affects its ability to pump blood to the rest of the body. This makes people over the age of 65 more susceptible to factors that can cause AHF, such as a different heart condition or existing symptoms of heart failure. Other heart conditions can lead to acute heart failure, such as: Cardiomyopathy, blood clots, myocarditis, endocarditis, disease of the heart valves, Arrhythmia in the lower chambers of the heart or in the upper chambers. ",
        "Acute HIV Infection" : "HIV is caused by a retrovirus which attacks the body's immune system, specifically CD4 blood cells which are responsible for fighting infections. During acute HIV infection, the HIV retrovirus destroys a lot of CD4 cells as it replicates. This can cause some people to fall ill with flu-like symptoms. ",
        "Acute Laryngitis" : "There are both infectious and non-infectious causes of acute laryngitis. The most common causes are a flu or cold due to a virus. Non-infectious causes include overuse of the voice, gastric reflux (which can irritate the lining of the throat), or an injury to the voice box region. ",
        "Acute Otitis Media" : "An infection can be caused by viruses (colds, the flu, etc.) or bacteria. ",
        "Acute Pancreatitis" : "Sixty to seventy-five percent of acute pancreatitis cases are caused by gallstones or high intake of alcohol. There is no identifiable cause for around 20 percent of acute pancreatitis cases; this is known as idiopathic pancreatitis. ",
        "Acute Panic Attack" : "Panic attacks can affect people of all ages and may occur during any activity and in any location. Many people will experience a panic attack or two during the course of their lifetime, without developing an ongoing problem. Often, a panic attack will be associated with undergoing a particularly stressful life event, such as bereavement, a job change or separating from a partner, but it is also common to be unable to identify a trigger. If a person experiences recurrent panic attacks, this is called panic disorder, a condition which is usually treatable with psychotherapeutic methods and/or medication. ",
        "Acute Pharyngitis" : "Pharyngitis is usually caused by the viruses that also cause a common cold or flu. In rare cases, the condition can be caused by bacteria. It is difficult to determine whether a case of pharyngitis has a viral or bacterial cause, since the symptoms are similar. Smoking, vaping and exposure to airborne irritants can also cause a sore throat.",
        "Acute Pyelonephritis" : "Most cases of acute pyelonephritis occur when bacteria, that are present in the gastrointestinal tract, come into contact with the urethra, move into the bladder and travel upward from the bladder to the kidneys. In rare cases, the condition can arise hematogenously, which means that the bacteria which cause it originate and travel in the blood. ",
        "Acute Stress Disorder" : "Acute stress disorder can develop after a person, of any age, experiences or witnesses a deeply distressing or traumatic event, often one that is life-threatening or perceived as life-threatening. ",
        "Acute Varicella Zoster (Chickenpox)" : "The varicella zoster virus, like most members of the herpesvirus family, is extremely contagious. The varicella zoster virus is spread through breathing, coughing and sneezing, as well as by touching the rash of someone with chickenpox. ",
        "Allergic Conjunctivitis" : "A person's immune system may be sensitive and react to certain substances such as pollen or molds. These are called allergens and, if they enter the eye, allergic conjunctivitis can result. The most common causes of allergic conjunctivitis are the following types of allergens: Pollens, including grass, tree and other plant pollens, molds, dust mites and animal dander. ",
        "Allergic Rhinitis" : "An allergic reaction happens when the immune system produces a type of antibody called Immunoglobulin E (IgE) after it is exposed to an allergen such as pollen.The IgE antibodies prompt the body to release chemicals, such as histamine, that cause inflammation in the nose and itchiness in the eyes. The allergens that trigger this kind of reaction vary from case to case.",
        "Alzheimer's Disease" : "The symptoms of Alzheimer's disease are directly caused by the cells that transmit information to and from the brain, known as neurons, ceasing to function and eventually dying. However, what causes this to occur is not yet known. ",
        "Amyotrophic Lateral Sclerosis (ALS)" : "Amyotrophic lateral sclerosis occurs when certain types of nerve cells, called neurons, degenerate and die. What causes ALS is not known. Men are slightly more likely to develop ALS than women, and most people develop the condition between the ages of 55 and 75. ",
        "Anal Cancer" : "The causes of anal cancer are not well understood. However, certain factors are thought to increase a person’s risk of developing the condition. It is most commonly linked to human papillomavirus (HPV), a sexually transmitted infection (STI) which more commonly causes genital and anal warts. ",
        "Anal Fissure" : "An anal fissure can occur when there is overstretching of the anal canal, which causes the lining to tear. Common causes include a large, hard or otherwise traumatic bowel movement, or anal penetration. ",
        "Anaphylaxis" : "Anaphylaxis is an extreme allergic response. Allergies occur when the immune system overreacts to a substance that it wrongly perceives as a threat. These substances are called allergens or triggers. Some people are sensitive to one or more allergens. Triggers for anaphylaxis are different from person to person, but are often everyday things such as insect stings or certain foods, such as nuts, shellfish or eggs. It does not occur on the first exposure to an allergen, but on subsequent exposures. ",
        "Anemia" : "There are many possible causes of anemia. These include: Dietary deficiencies of essential vitamins and minerals (such as vitamin B12, folic acid and iron), malabsorption of nutrients (e.g. in celiac disease, Crohn’s disease), substantial blood loss (e.g. from heavy menstruation or inflammatory bowel disease), bone marrow problems and leukemia, certain chronic conditions (e.g. rheumatoid arthritis, kidney disease), certain genetic disorders (e.g. thalassemia and sickle cell disease), Certain infections (e.g. malaria), certain medications and therapies (e.g. some types of painkillers, antibiotics, drugs for hyperthyroidism and cancer treatments), periods where the body needs more energy than usual (such as puberty and pregnancy). ",
        "Aortic Dissection" : "An aortic dissection typically occurs in a weakened area of the aorta. According to the Stanford classification system, there are two types of the condition, each defined by which part of the aorta is affected: Type A: Tear occurs close to where the aorta exits the heart or in the upper aorta, known as the ascending aorta. May affect the upper aorta only or the upper aorta, as well as the lower aorta. Type B: Tear occurs in the lower aorta, known as the descending aorta. ",
        "Aphthous Mouth Ulcers" : "The precise cause or causes of aphthous ulcers (canker sores) are unknown, however, it is thought that ulceration is brought about by one or a combination of external triggers. It may also be partly genetic, with 40 percent of people who experience ulcers having a family history of the condition. Possible triggers of aphthous ulcers include : Emotional stress, minor injury to the inside of the mouth, familial tendency, certain food and drinks, a deficiency of certain vitamins and/or minerals, an allergic reaction to oral bacteria, using or quitting tobacco products, hormonal changes associated with pregnancy and having a weakened immune system. ",
        "Arthritis" : "Arthritis has many possible causes, such as age-related wear and tear, autoimmune conditions, infections and injuries. ",
        "Asperger Syndrome" : "The causes of autism spectrum disorder are not yet fully understood. However, it is thought that genetic and possibly also environmental factors are involved. ",
        "Asthma" : "It is not always possible to identify the reasons why a person has developed asthma, and it is possible to develop the condition with no apparent trigger. The main causes of asthma are believed to include: Genetic predisposition, environmental factors and infections which affect the airways.",
        "Atherosclerosis" : "Atherosclerosis is caused by a buildup of plaque in the artery walls. Plaque is composed of calcium, cholesterol, fats and other substances found in the blood. If it hardens, plaque can block the arteries and restrict blood flow. A number of pre-existing conditions, lifestyle choices and other factors can make atherosclerosis more likely. The most common of these include: High cholesterol levels, high blood pressure, diabetes, smoking, obesity, lack of physical activity, unhealthy diet (high in salt, sugar, fats and cholesterol), aging, family history of cardiovascular disease, stress and alcohol consumption. ",
        "Atopic Dermatitis" : "The causes of atopic dermatitis are not yet fully understood. What is known is that the lipid (oily) barrier of skin is diminished in people with the condition and that substances, or cytokines, released by cells in the immune system may be a factor. There is a genetic element to atopic dermatitis. If both parents have the condition, a child stands roughly an 80 percent chance of inheriting it themselves; if only one parent has the condition, this figure drops to 60 percent. ",
        "Bacterial Conjunctivitis" : "Conjunctivitis is often caused by bacteria, a virus or allergies. If pink eye is caused by bacteria, it is called bacterial conjunctivitis. Like all types of pink eye, bacterial conjunctivitis is common but not usually serious. ",
        "Bacterial Gastroenteritis" : "Gastroenteritis is the result of irritation and inflammation in the stomach and intestines. It can have many different possible causes, including infection with a virus, such as rotavirus, bacteria or parasites. When caused by bacteria, it is called bacterial gastroenteritis. In some cases, the bacteria may be transmitted directly from one person to another, but they are typically spread through contaminated food and water.",
        "Bacterial Meningitis" : "Newborn children are the population group at the highest risk of meningitis, although this condition can affect people of all ages. Males may be slightly more at risk than females. People with other medical conditions, including a recent ear infection or throat infection, or who have had a recent skull fracture, are at increased risk of meningitis. ",
        "Bacterial Prostatitis" : "The prostate is a gland that sits under the bladder, and forms the first part of the urethra (the tube that carries urine away from the bladder). Bacterial infections can form in the prostate due to bladder infections or some sexually transmitted infections (STIs). Older men who already have an enlarged prostate gland are most commonly affected but men of every age can get bacterial prostatitis. Men who have diabetes, a weak immune system, an indwelling urinary catheter, or who self-catheterize (use a tube to empty the bladder of urine) are at higher risk of developing bacterial prostatitis. ",
        "Bacterial Sinusitis" : "Bacterial sinusitis often follows a viral infection, such as a cold or the flu. Viral infections can cause the mucosal lining of the sinuses to swell. In healthy sinuses, mucus drains into the nasal cavity via small holes, known as ostia. Swelling of the mucus membranes in the nose or sinus cavities can block these holes, preventing mucus from draining out of the sinuses. Bacteria colonize the undrained mucus, which can lead to bacterial sinusitis. ",
        "Benign Paroxysmal Positional Vertigo" : "The cause of BPPV is not well understood, however it is thought to be due to a problem in the inner ear caused by particles (crystals) irritating the semicircular canals, the part of the inner ear which regulates balance and equilibrium. In rare cases, head injury can lead to BPPV. ",
        "Benign Prostatic Hyperplasia" : "The exact cause of BPH is unknown, but it is thought mainly to be linked to hormonal changes. Many of these changes naturally affect older men, e.g., declining testosterone levels, which lead to a greater (relative) level of estrogen in the bloodstream. Some experts believe that a family history of prostate irregularities puts some men at greater risk of developing BPH. Certain genetic factors also seem to play a role in the development of BPH. ",
        "Bladder Cancer" : "Our cells normally divide to make new cells in a controlled way. Cancer first develops in the genes of one cell that becomes abnormal, so that it divides in an uncontrolled way. The abnormal cells often form a tumor, a mass of cells in one area of the body. As the tumor grows, cancer may invade nearby tissues and organs. ",
        "Breast Cancer" : "Breast cancer occurs when abnormal cells develop in the breast tissue and grow quickly and uncontrollably. These cells destroy and replace the normal breast tissue and may spread through the body. ",
        "Burnout" : "In most cases, burnout is work-related. However, other factors can contribute to the situation, such as demanding tasks and activities outside of work, certain personality traits (such as perfectionism), a stressful lifestyle and going through or supporting a loved one through a stressful life event. ",
        "Candida Vulvovaginitis" : "Most often, the condition is caused by changes in the environment of the vagina and gastrointestinal tract, which may be triggered by factors such as the use of certain medications or contraceptive devices, pregnancy and conditions including diabetes and HIV.",
        "Cataracts" : "The lens of the eye filters light onto the retina, allowing for clear and focussed vision. Largely, it is made from water and proteins. Cataracts are brought about when these proteins begin to clump in the lens, leading to blurred, faded and cloudy vision that can worsen over time. This clumping is commonly a result of aging, yet it is not clear why some people and not others are affected. There are, however, some factors that may increase an individual's chances of developing cataracts, including: Exposure to ultraviolet radiation from sunlight or radiation therapy, diabetes, eye conditions such as uveitis and glaucoma, eye injury or surgery, use of corticosteroids and a family history of cataracts. ",
        "Celiac Disease" : "Celiac disease is caused by a severe response to gluten, a type of protein found in wheat, barley, rye and several other grains. In some people who carry genes called HLA-DQ2 and HLA-DQ8, eating foods containing gluten can trigger the body's immune system to mistakenly damage the lining of the gut. It is not understood exactly why this happens. ",
        "Cervical Cancer" : "Most cervical cancer is caused by the human papilloma virus (HPV or wart virus). This virus causes changes in the cervical cells that may develop into cancer over time. People who have unprotected sex or who first have sex at an early age are more likely to get HPV and develop cervical cancer. People with a very weak immune system are also at higher risk of cervical cancer. Other things that increase the risk of cervical cancer are smoking and having a relative who has had cervical cancer. ",
        "Cervicitis" : "Sexually transmitted infections (STIs), including chlamydia and gonorrhea, are the most common cause of cervicitis. ",
        "Chest Cold" : "A chest cold can be either a viral or bacterial infection, though it is far more common to contract the condition virally. The viruses that cause the condition are of the same variety as those that cause the common cold or flu, and it usually develops from these conditions. These viruses are most commonly passed on through tiny droplets produced when an infected person coughs, sneezes or talks.",
        "Cholecystitis" : "In cases described as calculous cholecystitis, the cause of inflammation is thought to be the gallbladder being blocked or irritated by gallstones. Calculous cholecystitis accounts for the vast majority, 90-95 percent, of cases of gallbladder inflammation. In cases described as acalculous cholecystitis, the cause of inflammation is not gallstones, but a serious underlying illness, infection or injury that affects the gallbladder, causing bile to build up and become stagnant. ",
        "Chronic Heart Failure" : "The causes of the condition vary, each affecting the ability of the heart to pump blood around the body effectively, but some of the most common risk factors include old age, diabetes, high blood pressure and being overweight. ",
        "Chronic Idiopathic Constipation" : "The causes of chronic idiopathic constipation are largely unknown. However, possible causes include a reduction in fluid and fiber intake in the diet, changes in water balance, and changes in contractility of the colon. ",
        "Chronic Laryngitis" : "Laryngeal symptoms such as cough, sore throat and hoarse voice are frequently caused by prolonged irritation of the larynx and vocal cords. That may have infectious or non-infectious causes such as the overuse of the voice, alcohol, smoking, air pollution, allergies... ",
        "Chronic Pancreatitis" : "Chronic pancreatitis occurs when there is damage to the pancreas that does not heal or improve. The most common causes are chronic consumption of large amounts of alcohol over many years, using tobacco products, autoimmune conditions and repeated episodes of acute pancreatitis. ",
        "Chronic Pelvic Pain" : "There are many possible causes for pelvic pain, including underlying medical conditions such as pelvic inflammatory disease and irritable bowel syndrome, as well as nervous system dysfunction. The condition is also associated with social and psychological factors, including physical and mental abuse. ",
        "Chronic Renal Failure" : "Chronic renal failure mostly occurs in people who have other medical conditions which cause damage to the small units in the kidneys, called nephrons, which are responsible for filtering waste and fluid from the blood. These conditions include diabetes, high blood pressure or hypertension and long-term inflammation of the kidneys. ",
        "Cluster Headaches (CHs)" : "Only a small amount of information about the physiological mechanism that leads to cluster headaches is known. CHs are linked to increased activity in a part of the brain called the hypothalamus, which contains a control centre for many of the functions of the autonomic nervous system. They are also been linked to a person having elevated levels of histamine, a chemical produced as part of the body's immune response to allergens. And finally, a person's food intake may contain histamine-rich foods, which can cause CHs.",
        "Cold Sores (Herpes Labialis)" : "The viruses that cause cold sores are very contagious. The entry port is usually the mucous membrane of the mouth, but the virus can also enter the body through a small wound. Transmission can occur if you come into direct contact with a herpes blister or the saliva of someone who currently has a herpes blister. You can also get infected if you share dishes, cutlery, towels, cosmetic tissues, toothbrushes, toothbrush holder, or razors with someone who currently has cold sores. ",
        "Colorectal Cancer" : "Genetically inherited conditions, preexisting health conditions and a person’s lifestyle can all be factors contributing to the development of cancer of the colon or rectum. Colorectal cancer is more likely to affect a person when they are over 50, but some younger people, especially those with certain health conditions, are at an increased risk. ",
        "Common Cold" : "There is a large range of viruses that can cause a cold. Most colds are caused by a group of viruses known as rhinoviruses, of which there are over a 100 different types.",
        "Concussion Syndrome" : "Concussion is a mild injury due to a blow to the head. Common causes are contact sports and accidents. People aged 65 or older, who have had brain surgery or who bleed easily are at a higher risk of concussion after a head injury. ",
        "Conversion Disorder" : "Conversion episodes are nearly always triggered by an overwhelmingly stressful event, an emotional issue or a mental health disorder, such as depression. Although there may be no medical or physical cause found to explain the symptoms, they are real to the person who is experiencing them. ",
        "Costochondritis" : "The specific cause of costochondritis is still unknown. However, in some cases, costochondritis may occur due to the following: An injury or a blow to the chest, Physical strain, Severe coughing and an infection. ",
        "COVID-19 (coronavirus disease 2019)" : "Coronaviruses are a large family of viruses that cause infection in a variety of animal species. Bats appear to be the reservoir of the COVID-19 virus, but the intermediate host(s) has not yet been identified. Coronaviruses can also spread between animals and humans, and in some cases, also between humans. This is rare, but in the past, has led to outbreaks (MERS-CoV and SARS). ",
        "Crohn's Disease" : "Crohn's disease is believed to be caused by an overactive immune response which results in inflammation within the digestive system. ",
        "Cushing's Syndrome" : "Cushing's syndrome develops if there is too much cortisol in the body. The most common cause is taking a steroid medication for a long period of time. Cushing's syndrome can also occur when the body produces too much cortisol. This happens when a growth or cancer causes too much cortisol to be produces. ",
        "Dementia With Lewy Bodies" : "Risk factors for this condition include being older than 60, being male, and having a family member who has had this condition, Parkinson's disease or Alzheimer's disease. ",
        "Dental Abscess" : "Dental abscesses are the result of bacterial infection. When the gum tissue surrounding a tooth becomes damaged or the tooth itself is damaged, bacteria that are already in the mouth and, under usual circumstances not harmful, may enter the area and cause infection. One of the most common causes of damage to the teeth and gums is poor dental hygiene. ",
        "Diabetes" : "The amount of glucose in the blood is controlled by a hormone called insulin, which is produced by the pancreas (a gland behind the stomach). When food is digested and enters your bloodstream, insulin moves glucose out of the blood and into cells, where it's broken down to produce energy. However, if you have diabetes, your body is unable to break down glucose into energy. This is because there's either not enough insulin to move the glucose, or the insulin produced doesn't work properly.",
        "Disseminated Tuberculosis" : "Tuberculosis (TB) is very infectious. The bacterium that causes tuberculosis, Mycobacterium tuberculosis, is spread through the air and via droplets from the mouth or throat of person infected with the pathogen. Infectious patients cough up large numbers of mycobacteria, which can survive on objects outside of the body for a long time. ",
        "Diverticulitis" : "The risk of getting diverticular disease and diverticulitis increases with age, and most commonly affects people older than 60 years of age. Eating a low-fiber diet (a diet high in processed foods) has often been seen as a cause, although the link is not clear. ",
        "Early Disseminated Lyme Disease" : "Lyme disease is caused by bacteria called Borrelia burgdorferi. These bacteria are spread through tick bites. This condition can not be passed from person to person. These ticks are mostly found in wooded, rural areas throughout Europe and North America. People who work outside or who spend time in woodland or heaths are most commonly affected. ",
        "Ebola Virus Disease" : "This condition is caused by a highly contagious virus. Transmission occurs through contact with body fluids, such as blood, sweat, urine, saliva (spit) and broken skin. People exposed to objects contaminated with these fluids, animals or people with the illness have an increased risk of infection. Although highly contagious, the virus does not spread through the air or by touch. ",
        "Endocarditis" : "Endocarditis may occur when bacteria or fungi enter the bloodstream through small injuries (such as those experienced during teeth cleaning), when injecting into the veins, during surgery, or as a result of other infections. If the bacteria or fungi reach the heart, they may settle on the endocardium (the heart’s inner lining or valves) and begin to grow, causing an infection. ",
        "Endometrial Cancer" : "Endometrial cancer is a cancer originating from the cells which line the uterus. This condition is most common in women who have been through menopause. Other factors that increase the risk of developing endometrial cancer include obesity, never having given birth, the use of hormone-containing medications (including tamoxifen to treat breast cancer, and hormone replacement therapy) and smoking. People who have a family member with endometrial cancer have a higher risk of developing this condition. ",
        "Endometrial Polyps" : "Endometrial polyps are caused by the overgrowth of endometrial tissue, which is the lining of the uterus that swells and then shrinks during the menstrual cycle. Endometrial polyps are estrogen-sensitive, with hormones in the bloodstream playing a role in their occurrence.",
        "Epstein-Barr Virus" : "The Epstein-Barr virus is extremely contagious, and new infections are especially common in populations of high-school and college-age adults. It is spread by contact with infectious bodily fluids, especially saliva, and is therefore sometimes known as the kissing disease. ",
        "Esophageal Cancer" : "A history of gastroesophageal reflux disease (GERD), smoking and excessive alcohol intake increases the risk of esophageal cancer. ",
        "Essential Tremor" : "Fabry disease is caused by a genetic mutation. It is an X-linked disorder, meaning that the condition only affects the X-chromosome. As females have two X-chromosomes and males just one, males stand a far higher chance of inheriting the condition from a parent, because a second X-chromosome offers some, but not total, protection against the mutation. ",
        "Fibromyalgia" : "The causes of fibromyalgia are largely unknown. There are several factors that may combine to trigger the symptoms of fibromyalgia. These include having a family member who also suffers from fibromyalgia, depression, disturbed sleep, stress, and suffering a muscular injury or emotional trauma. ",
        "Folate Deficiency" : "Folate deficiency has a number of potential causes. Most healthy people absorb sufficient folate from their diets to avoid deficiency, but in some cases the body may increase demand, which, if supplementation doesn’t occur, may lead to deficiency. In other cases, the body may be unable to absorb enough folate, due to low intake or excessive excretion. ",
        "Functional Dyspepsia" : "Functional dyspepsia is indigestion with no clear cause. Despite this, there are certain triggers which may bring on or worsen the symptoms of the condition. They include: Smoking and alcohol, Obesity, Stress and anxiety, Infection with the germ Helicobacter pylori and Impairment of the stomach muscles. ",
        "Gallstones (Symptomatic Cholelithiasis)" : "The majority of gallstones are made mostly of cholesterol and are called cholesterol stones. In these cases, the amount of cholesterol within the bile is too high and causes the formation of a solid stone. Less commonly, there are also gallstones made up of bilirubin, a breakdown product of red blood cells, and also gallstones caused by an imbalance of bile salts, lecithin, or calcium carbonate. ",
        "Gastroenteritis" : "Viruses are the most common cause of acute gastroenteritis, particularly in children. However, the following can also cause the condition: Bacteria and their byproducts, Parasites, Toxic chemicals and certain drugs. ",
        "Gastroesophageal Reflux Disease" : "The esophageal sphincter, a circular band of muscle at the base of the esophagus, usually prevents acid from leaking. Gastroesophageal reflux disease occurs when the sphincter becomes weakened and does not function as well as it should. There are various reasons why this can happen, but, in some cases, the exact cause cannot be identified. ",
        "Genital Herpes" : "Genital herpes is caused by the human herpes simplex virus (HSV), specifically HSV-2 and HSV-1. This virus is spread through skin contact, genital contact or oral contact with people who have the virus.  ",
        "Neonatal Jaundice" : "Neonatal jaundice is caused by a buildup of the chemical compound bilirubin in the blood. Normally, the liver breaks down bilirubin and disposes of it through urine and stool. If bilirubin is produced faster than it can be broken down, jaundice occurs."

     }
    },
    {"question_type" : "diagnosis",
    "patterns" : ["How can it be diagnosed ?","How to know if I have it ?","How a doctor would diagnose it ?","How to be sure if I have it ?","How can a doctor identify it ?","how to diagnose it"],
    "responses" : {
        "Abdominal Pain" : "Like many kinds of pain, abdominal pain cannot be diagnosed through any kind of test. For most individuals, pain can vary greatly in its intensity. There are different methods to try and measure pain severity, for example through a scale from 0 (= no pain at all) to 10 (= worst pain imaginable). For abdominal pain it's important to rule out other conditions as a cause.",
        "Achilles Tendonitis" : "Achilles tendonitis can usually be diagnosed based on the symptoms, following a physical examination of the ankle and tendon. Other tests may be needed in more serious cases of Achilles tendonitis to establish the extent of the problem. These may include: X-ray and Magnetic resonance imaging (MRI) scan. ",
        "Acute Aspiration of Oropharyngeal or Gastric Contents" : "The diagnosis is based on the symptoms, a physical examination and a chest X-ray or CT scan. Other tests that may be useful include tests of swallowing function and testing the airway mucus for bacteria. ",
        "Acute Bronchitis" : "In its early stages, it may be difficult to distinguish the condition from a common cold. However, in the majority of cases, a doctor will be able to diagnose a person accurately after performing a physical examination and inquiring about what symptoms are being experienced. ",
        "Acute Gastritis" : "Diagnosis of acute gastritis is usually suspected based on a person's medical history and physical examination. Afterwards it's confirmed by taking a biopsy sample from the stomach lining. This is essential for making the correct diagnosis. ",
        "Acute Heart Failure" : "Diagnosis is based on the symptoms, patient history and physical examination for signs that the heart is failing to pump enough blood. Diagnostic tests can identify what type of heart failure is involved and which ventricle or side of the heart is involved, as treatments can differ. ",
        "Acute HIV Infection" : "The only way to confirm an acute HIV infection diagnosis is to be tested for HIV. There are different types of tests, depending on how long it has been since the person's potential exposure to the HIV virus. Testing will involve either a sample of fluid swabbed from the mouth, or a blood sample. ",
        "Acute Laryngitis" : "The diagnosis is usually made by examination of the throat. Doctors will focus on diagnosing the cause of the laryngitis, because this will determine the appropriate treatment, if any is needed. If laryngitis is due to a known underlying condition such as gastrointestinal reflux disease (GERD), the treatment and management plan for this may be adjusted, to prevent further laryngeal problems. ",
        "Acute Otitis Media" : "The diagnosis is usually made by a doctor based on the symptoms and physical examination. An otoscope may be used, a small tool used to look at the eardrum. ",
        "Acute Pancreatitis" : "Diagnosis of acute pancreatitis is based on the symptoms and a physical examination. A diagnosis will generally be confirmed if two of the following three symptoms are present: Abdominal pain, increases of amylase and lipase levels in the blood that are threefold or higher and inflamed pancreas ; seen on a CT scan or MRI scan. ",
        "Acute Panic Attack" : "Your GP will ask you to describe the symptoms you've been experiencing. They'll also ask you how often your symptoms occur and in what situations. It's important to tell your GP about how you've been feeling and how your symptoms have affected you. ",
        "Acute Pharyngitis" : "A doctor will usually diagnose the condition through a physical examination that may include: A close look at the throat, ears and nasal passageway, checking for swollen glands and listening to a person's breathing using a stethoscope. If bacterial pharyngitis is suspected, a doctor may also take a swab from the throat and have it tested for the presence of bacteria.",
        "Acute Pyelonephritis" : "Apart from noting the symptoms, doctors examining a patient with suspected acute pyelonephritis will obtain a urine sample from them, and perform a basic test for abnormal color and odor. Additionally, they may perform tests such as: Dipstick analysis, urinalysis (analysis of the urine), a bacterial culture of the urine, blood tests and imaging tests such as an MRI, CT scan or ultrasound. ",
        "Acute Stress Disorder" : "ASD can be diagnosed after symptoms have been experienced for at least three days. It is not possible to self-diagnose with ASD, as diagnosis requires an objective analysis of the symptoms of the affected person. If a person has experienced a traumatic event and thinks that they may have ASD, it is recommended that they visit a healthcare practitioner. ",
        "Acute Varicella Zoster (Chickenpox)" : "Diagnosis is usually based on the symptoms and the appearance of the blisters that accompany the rash. Testing fluid from the blistering rash for the varicella zoster virus can confirm the diagnosis. ",
        "Allergic Conjunctivitis" : "When symptoms are mild, a diagnosis of allergic conjunctivitis can often be made without seeing a doctor, and the condition can be treated at home. However, if there is any uncertainty or concern over the eye condition or the symptoms are severe, seeing a doctor is very important. In most cases, it will not be necessary to perform any special tests. However, in some cases a doctor will order allergy tests, e.g. skin patch tests, to identify allergens and confirm the diagnosis. ",
        "Allergic Rhinitis" : "Guidelines for diagnosis of allergic rhinitis are usually based on the symptoms reported by the affected person and their family history. Additional tests are sometimes required if the trigger for the allergic rhinitis is unknown. These tests involve giving the affected person small amounts of specific allergens to see if an allergic reaction takes place. This may include one or more of the following tests: Intradermal test, prick or scratch test and blood test. ",
        "Alzheimer's Disease" : "There is no definitive test for Alzheimer's disease. Instead, a doctor will usually make a diagnosis based on the symptoms and several tests. A family member or friend may need to be involved to be asked questions about the severity of symptoms, as the person affected may not be the best guide in respect of how they are behaving.",
        "Amyotrophic Lateral Sclerosis (ALS)" : "Diagnosis of amyotrophic lateral sclerosis is made by evaluating the symptoms and undergoing a physical examination by a neurologist. There is no single diagnostic test for ALS. However, several tests are needed to confirm the diagnosis and rule out other possible causes of symptoms, such as HIV, polio or West Nile virus. ",
        "Anal Cancer" : "Symptoms of anal cancer may be caused by a number of other conditions, including hemorrhoids, anal fissures, or anal warts. A doctor will need to rule these out in the diagnostic process by taking the person's medical history, performing a physical examination and maybe performing the following tests: Digital rectal examination (DRE), Anoscopy, Biopsy, Ultrasound, X-ray, computed tomography (CT scan), magnetic resonance imaging (MRI) or positron emission tomography (PET scan). ",
        "Anal Fissure" : "A doctor may diagnose anal fissure based on a description of the symptoms and a physical examination. The physical examination usually involves gently separating the buttocks to allow a doctor to see the area around the anus. ",
        "Anaphylaxis" : "After life-saving emergency treatment has been started and symptoms have been brought under control, blood tests can be done to confirm anaphylaxis or rule out other causes of the symptoms. One particularly important test measures mast cell tryptase, a chemical released by the immune system in a severe allergic reaction. This blood test should be done as soon as possible and no later than four hours from the onset of symptoms. ",
        "Anemia" : "As the first step, a doctor will typically take the person’s medical history and perform a physical examination. They may then order blood tests to check: Hemoglobin levels and red blood cell size (complete blood count), Vitamin B12 and folic acid levels and Kidney function. The doctor may also ask for the following tests to be done: Urine tests, stool (feces) tests, a bone marrow biopsy (removing a small sample for examination) and a gastroscopy or colonoscopy to examine the digestive tract. ",
        "Aortic Dissection" : "The diagnosis is made by a doctor based on the symptoms and appearance of the affected person. In an emergency situation, an ultrasound scan may be carried out immediately to confirm the diagnosis. Other tests that may help to confirm the diagnosis include: Electrocardiogram (ECG), X-rays of the chest and abdomen, CT scan (computed tomography) and MRI scan (magnetic resonance imaging scan). ",
        "Aphthous Mouth Ulcers" : "In most cases, especially when the condition is not recurrent, diagnosis will be based around medical examination and an investigation of an individual's medical history. The diagnostic process may involve the ruling out of other conditions through blood tests or, less often, using a gastroscopy or colonoscopy, possibly also obtaining tissue samples. The course the diagnostic work-up will take will depend on the doctor’s evaluation of the severity of an individual’s condition and the presence of any other symptoms. ",
        "Arthritis" : "Following the investigation of a person’s medical history, a doctor will typically perform a physical exam to check for swollen joints or loss of motion, and use blood tests and X-rays to confirm a diagnosis and distinguish the type of arthritis. ",
        "Asperger Syndrome" : "Autism spectrum disorder, whether in a child or adult, can only be diagnosed by a licensed healthcare professional. They will typically use a number of different assessments and tests to confirm the diagnosis. ",
        "Asthma" : "If you have typical asthma symptoms, your GP will often be able to make a diagnosis. They will want to know when the symptoms happen and how often, and if you have noticed anything that might trigger them. Your GP may also ask whether you have any allergic (atopic) conditions such as eczema and hay fever, which often occur alongside asthma. A number of tests can be carried out to confirm the diagnosis.",
        "Atherosclerosis" : "Diagnosing atherosclerosis will generally involve a doctor looking at the person's medical history, a physical examination and a range of tests. During the physical examination, a stethoscope will normally be used to listen to the person's heartbeat and blood flow in the vessels. The medical professional will take special care to listen for sounds that indicate the narrowing of the blood vessels, which can often indicate the presence of plaque and clogged arteries. Tests that may aid a diagnosis of atherosclerosis include: Blood pressure measurement, Blood tests, Electrocardiogram (ECG), Chest X-ray, Echocardiography, Computed tomography (CT) scan and Angiography. ",
        "Atopic Dermatitis" : "A doctor or dermatologist will usually diagnose atopic dermatitis based on the symptoms and an examination of the affected skin. Skin or blood tests are not usually necessary to reach a diagnosis.",
        "Bacterial Conjunctivitis" : "When symptoms are mild, a diagnosis of bacterial conjunctivitis can often be made without seeing a doctor, and the condition can be treated at home. However, if there is any uncertainty or concern over the condition, or the symptoms are severe, seeing a doctor is very important. A doctor will take the person's medical history and ask whether anyone they know might have had an eye infection recently. They will examine the eyes and assess the signs and symptoms present, taking care to rule out acute viral conjunctivitis, allergic conjunctivitis and other more serious eye conditions, such as uveitis. ",
        "Bacterial Gastroenteritis" : "A doctor will take the person's medical history and perform a physical examination, taking care to rule out other gastrointestinal conditions such as gastritis. In most cases, it will not be necessary to order tests to confirm the diagnosis of gastroenteritis. However, in cases that are severe or long-lasting, a doctor may request blood tests and/or stool tests. ",
        "Bacterial Meningitis" : "Diagnosis is based on the symptoms, the physical examination and tests which confirm the presence of a severe infection in the body. A sample of cerebrospinal fluid, the fluid in the meninges around the brain and spinal cord is taken and tested for the specific bacteria causing the infection. ",
        "Bacterial Prostatitis" : "The diagnosis is made based on the symptoms, examination of the prostate, and urine tests. Examination of the prostate involves a doctor gently putting a finger into the anus and feeling the prostate through the rectum (from behind the prostate). This can be a little painful for people with prostatitis. The urine is tested for bacteria, and this is sometimes requires prostatic massage, a procedure in which a doctor massages the prostate before the urine sample is made. ",
        "Bacterial Sinusitis" : "The diagnosis is based on the symptoms and physical examination. In severe cases or cases that do not respond to treatment, a nasal endoscopy may be done to aid diagnosis and treatment. ",
        "Benign Paroxysmal Positional Vertigo" : "Diagnosis is made by a doctor with the help of a physical examination. The diagnosis can be confirmed with specific tests. ",
        "Benign Prostatic Hyperplasia" : "Diagnosing BPH will typically begin with the doctor taking a medical history, including questions to find out if the affected person has a family history of prostate problems, followed by a full medical examination. The examination will include a digital rectal examination (internal examination of the rectum). Other exams and tests may include : Urinalysis, Blood tests, Uroflowmetry, Abdominal ultrasound and Transrectal ultrasound. ",
        "Bladder Cancer" : "If a person has blood in their urine, they should go to a doctor. A sample of urine from the affected person may be analysed in a laboratory to look for the presence of blood, bacteria or cancer cells. It can also rule out other, more likely causes of blood in the urine, such as a urinary tract infection. The doctor may also carry out a physical examination of the rectum, the final section of the large intestine, terminating at the anus and/or vagina. This is because bladder cancer may cause a lump that can be felt by pressing against the walls of the rectum and/or vagina. If bladder cancer is suspected, a person may be referred to hospital for further tests. These tests may include: Blood tests, a cystoscopy, imaging scans and Transurethral resection of a bladder tumor. ",
        "Breast Cancer" : "Diagnosis is usually made during breast cancer screening. Screening is important because it allows breast cancer to be detected and treated at an early stage. The earlier the cancer is found, the better the chances of surviving it. Breast cancer screening is normally done by mammogram, a type of X-Ray scan. In order to rule out a cancer diagnosis, a test, known as a biopsy may be carried out that removes tissue or sometimes fluid from an area suspected to be cancerous. Local anesthetic may be administered, depending on the type of biopsy used. ",
        "Burnout" : "A diagnosis of burnout is made by a doctor. The medical definition of burnout differs from the common usage. But a early diagnosis may help a person more quickly regain a healthy work-life balance. ",
        "Candida Vulvovaginitis" : "A diagnosis can usually be confirmed following an examination by a doctor. The affected person may also be asked about their medical history and whether they have had the condition before. In addition to that, those experiencing recurrent bouts of candida vulvovaginitis are likely to have a swab sample taken from their vagina. ",
        "Cataracts" : "Cataracts are diagnosed through a full eye examination carried out by an optometrist or ophthalmologist. Those experiencing problems with their sight should visit an eye care professional as soon as possible. Moreover, people over 40 should undergo an eye test at least once every two years. ",
        "Celiac Disease" : "After taking the person's medical history and performing a physical examination, a doctor will typically order blood tests if celiac disease is suspected. If the results suggest that celiac disease is present, a biopsy will then be recommended to confirm the diagnosis. ",
        "Cervical Cancer" : "The diagnosis may be based on screening for changes in cervical cells. Women are regularly screened (tested without symptoms) for cervical cancer. The most common test for screening is a Pap smear. This test involves sampling cells from the cervix and looking at them under a microscope. If there are signs that a cancer could be developing, a biopsy (a bigger sample of the cervix) may be needed to identify the type of cancer. ",
        "Cervicitis" : "Women displaying the symptoms of cervicitis should see a doctor for diagnosis. Doctors will be able to identify the condition, as well as any other conditions that involve similar symptoms. Diagnosing cervicitis will usually involve tests including: A speculum exam, a speculum exam, a bimanual pelvic exam and tests for STIs. ",
        "Chest Cold" : "Doctors will usually be able to diagnose a chest cold by asking some questions about a person's symptoms and by performing a physical examination. In some cases, a doctor may order further tests to diagnose the condition or distinguish it from other conditions. These tests include: Pulmonary function test, Sputum tests and X-ray. ",
        "Cholecystitis" : "As a first step, a doctor will assess the person's symptoms, take their medical history and perform a physical examination. The doctor may order a urine test to check for signs of kidney problems and blood tests to check for signs of infection or problems in the liver or pancreas. They may also request that an ultrasound scan computed tomography (CT) scan or other imaging tests be performed to examine the gallbladder and other parts of the abdomen and confirm the diagnosis. ",
        "Chronic Heart Failure" : "Diagnosis is typically based on a person's medical history, a physical examination and a series of tests. Tests are used by doctors to identify the underlying cause of the chronic heart failure and may include: Chocardiogram (ultrasound), Electrocardiogram (ECG), Chest X-ray and Brain natriuretic peptide (BNP) or N-terminal pro-BNP (NT-proBNP). ",
        "Chronic Idiopathic Constipation" : "To confirm the diagnosis, all other causes of constipation, for example a medical condition or medication should be excluded. Doctors who treat constipation are often specialists in gastroenterology. There are various international gastroenterological criteria that help doctors to determine whether CIC, rather than IBS, is present. Some tests that may be done to aid diagnosis include: Colonoscopy and blood tests. ",
        "Chronic Laryngitis" : "The diagnosis of persistent laryngitis is usually made by assessing the symptoms and examining the throat. In some cases, a doctor will examine the throat of someone who may have chronic laryngitis with a small instrument known as a laryngoscope. This is often done if the affected person has trouble breathing or swallowing, or earache. There are three types of laryngoscopy: Indirect laryngoscopy, Direct fiber-optic laryngoscopyand Direct laryngoscopy. ",
        "Chronic Pancreatitis" : "Diagnosis will start with taking a medical history and a physical examination. Blood tests may be performed which can also be used to identify or exclude other potential causes for the symptoms, such as problems with the gallbladder or bile duct. Imaging tests and tests for pancreatic function can diagnose chronic pancreatitis, but the results may not point to a conclusive diagnosis in the early stages. ",
        "Chronic Pelvic Pain" : "A doctor will typically first inquire about the affected person's symptoms, their medical history and carry out a physical examination. At this stage, the affected person may be required to fill out a symptom questionnaire, as well as undergo a single digit or bimanual vaginal examination. If there is no obvious cause of the condition after the initial stage of diagnosis, a number of diagnostic tests will typically be carried out. ",
        "Chronic Renal Failure" : "Chronic renal failure can be diagnosed by measuring kidney function and is typically tested for by taking blood and urine samples to measure creatinine levels. This is a waste product of creatine, which is a chemical the body produces to supply energy, primarily to muscles and the brain. ",
        "Cluster Headaches (CHs)" : "There are no specialized diagnostic tests to establish whether a person is affected by cluster headaches. To diagnose CHs, a doctor will assess the following criteria: Brain function, the person's medical history and find out whether a person's experience of their headache(s) matches the diagnostic criteria for a cluster headache. ",
        "Cold Sores (Herpes Labialis)" : "The diagnosis is based on the symptoms and appearance of the blisters. The examination of the fluid or a tissue sample from a blister can be used to confirm the diagnosis of the herpes virus. However, this is usually only the case if the diagnosis is unclear or if other causes are also likely. With people with a weakened immune system, the diagnostic measures may also need to be more extensive. ",
        "Colorectal Cancer" : "The cancer is diagnosed through certain tests that allow a doctor to look inside a person's large intestine. This can be achieved by inserting a camera into a person's body, such as in a colonoscopy or by using X-rays. ",
        "Common Cold" : "Most people will be able to self-diagnose a cold by recognizing the symptoms being experienced. This will also be the case if a doctor is consulted, though this will not be necessary in most cases. If a complication is suspected, various tests may be ordered (such as an X-ray). ",
        "Concussion Syndrome" : "The diagnosis is based on the symptoms and a examination of the nervous system. If the head injury was severe, a computed tomography scan (CT scan) or a magnetic resonance imaging scan (MRI scan) may be needed to exclude a severe brain injury. ",
        "Conversion Disorder" : "Diagnosis is made by a doctor or psychiatrist based on the history of the affected person’s symptoms, as well as a discussion about their life and feelings. It can be difficult to diagnose conversion disorder, and multiple tests are often performed to exclude other causes of the symptoms. A diagnosis is usually reached by process of elimination. ",
        "Costochondritis" : "The diagnosis of costochondritis is usually made during a physical exam. Before a diagnosis can be confirmed, your GP may ask to carry out some tests to exclude other possible causes of chest pain. These include a chest X-ray, an electrocardiogram (ECG or EKG), and blood tests.",
        "COVID-19 (coronavirus disease 2019)" : "Laboratory testing of respiratory samples confirm SARS-CoV-2 infection. ",
        "Crohn's Disease" : "In order to establish a diagnosis of Crohn's disease, doctors will consider a person's medical history and symptoms and will also perform a physical examination. They will often also conduct laboratory studies and further tests in order to establish the nature and severity of the condition. ",
        "Cushing's Syndrome" : "Diagnosis is made by evaluating a person's medical history, with special attention to medications, and physical examination where the doctor checks for the typical signs of Cushing's syndrome. If a medication isn't the cause of the symptoms, saliva, urine and blood tests are done to test cortisol hormone levels, and imaging tests (ultrasound, computed tomography (CT) and magnetic resonance imaging (MRI)) may be done to look for a cause for the excess cortisol.",
        "Dementia With Lewy Bodies" : "The diagnosis is made by a doctor assessing the symptoms and performing a complete neurological examination and assessment of the mental abilities (such as memory testing). Blood tests and a CT (computed tomography) or MRI (magnetic resonance imaging) are often done to exclude any other possible causes for the symptoms. ",
        "Dental Abscess" : "The dentist will perform an examination of the affected area. They may test the affected tooth by pressing on it or tapping it with an instrument. If the tooth is infected, it will usually be very sensitive to pressure or tapping (percussion), and may often be painful. While laboratory testing is not usually needed to establish whether or not an abscess is present, dentists will usually do an X-ray of the affected tooth and the mouth as a whole to establish the exact location and the size of the abscess. ",
        "Diabetes" : "Diagnosing diabetes will typically involve an evaluation of the symptoms being experienced and a variety of diagnostic tests. These tests may include: Random blood glucose test, Fasting plasma glucose (FPG) test, HbA1c test and Oral glucose tolerance test. Tests to distinguish between type 1 and type 2 diabetes, such as a urine ketone test or glutamic acid decarboxylase (GAD) autoantibodies tests, may also be necessary. ",
        "Disseminated Tuberculosis" : "The diagnosis of this form of TB involves taking a sample from the organ, that is believed to be affected, to prove the presence of an infection. ",
        "Diverticulitis" : "The diagnosis is usually made on the basis of medical history and physical examination. A computed tomography (CT) scan may be needed to identify the location of the inflammation in the bowel and confirm the diagnosis. ",
        "Early Disseminated Lyme Disease" : "The diagnosis is usually based on two aspects: the appearance of the 'bull's eye' rash and a history of travel or activities in areas where ticks are present (e.g. work or travel in wooded areas of North America). Once Lyme disease has spread, it can be difficult to diagnose, as only some people remember having a 'bull's eye' rash. In this situation, Lyme disease is usually diagnosed with a blood test. ",
        "Ebola Virus Disease" : "The early symptoms of Ebola infection are very similar with those of flu or malaria, so early diagnosis can be difficult. Blood tests are used to confirm the infection by Ebola virus. If symptoms are not seen within 21 days this condition is excluded. ",
        "Endocarditis" : "If a diagnosis of endocarditis is suspected based on the symptoms and medical history, a thorough physical examination will be carried out, paying particular attention to the heart. In particular, doctor's will listen for heart murmurs (unusual sounds from the heart), which can be an indicator of the condition. A doctor will in most cases then also order a series of tests to confirm the diagnosis. ",
        "Endometrial Cancer" : "Diagnosis is usually made based on the symptoms and an ultrasound of the uterus. A tissue sample of the cancer (a biopsy) is taken and investigated to confirm the diagnosis. ",
        "Endometrial Polyps" : "Transvaginal ultrasound (TVUS) is the first-line method for evaluating women with abnormal vaginal bleeding. If the ultrasound finding is uncertain, there are two other options. One is where the physician carries out a more specialized ultrasound, called a sonohysterography or a saline infusion sonogram (SIS). The second option, should a TVUS be uncertain, is a hysteroscopy. This allows a more direct view of the inside of the uterus. ",
        "Epstein-Barr Virus" : "While infectious mononucleosis is usually diagnosed by a physical examination and consideration of the symptoms shown by the the affected person, laboratory tests can also be used to confirm an Epstein-Barr virus infection as well as infectious mononucleosis. ",
        "Esophageal Cancer" : "A diagnosis is made based upon the symptoms, a physical examination and a test called endoscopy (in which a small flexible camera is inserted into the body through the mouth to look at the esophagus and stomach). If anything abnormal is seen, a sample of the esophagus can be taken (a biopsy) to investigate for cancer. Scans, such as a CT (computed tomography) are often needed to determine the size, location and developmental stage of the esophageal cancer. ",
        "Essential Tremor" : "Laboratory testing can confirm the presence of Fabry disease. Enzyme assay, as the method is known, measures the volume of alpha-galactosidase A in the body. For males, this involves a blood test. If the blood shows a person has low levels of the enzyme, Fabry disease can be confirmed. This test can also be carried out on females, but may not be as accurate. DNA testing is a far more accurate test for Fabry disease diagnosis in females. ",
        "Fibromyalgia" : "The diagnosis may be made based on the symptoms, the duration of pain and the physical examination. A diary of symptoms may help to make the diagnosis. A blood test may also help to confirm the diagnosis in some people, but a normal or negative result does not exclude fibromyalgia. However, to confirm the diagnosis, a doctor should exclude other possible causes of the symptoms. Blood and urine tests are often done with the aim of excluding other conditions. ",
        "Folate Deficiency" : "Diagnosis is based on evaluation of symptoms and blood tests. Although there is no official medical consensus of what level of folate in blood serum indicates a deficiency, most practitioners agree that a level of less than seven nanomols per liter (7nmol/L) is problematic. ",
        "Functional Dyspepsia" : "Diagnosing functional dyspepsia involves ruling out other conditions that may be causing the dyspeptic symptoms. Tests to check for conditions such as stomach ulcers, stomach cancer and gallstones must first return negative before a diagnosis can be given. If the digestive system appears normal (free of ulcers, for example), a diagnosis of functional dyspepsia can be given. Blood tests, as well as tests to check for the presence of Helicobacter pylori, may also be useful in diagnosing the disorder.",
        "Gallstones (Symptomatic Cholelithiasis)" : "Usually, the diagnosis can be made quickly if a doctor collects a person’s medical history (anamnesis) and physical examination, as well as laboratory tests, and ultrasound. ",
        "Gastroenteritis" : "Many cases of gastroenteritis go away on their own, without treatment, and without the need for a formal diagnosis by a doctor. It is important to see a medical practitioner to identify the cause of the illness if the condition does not clear within a few days, or if there are any causes for concern, such as: Blood or pus in the stool, Constant vomiting or diarrhea, a high fever and symptoms of dehydration. ",
        "Gastroesophageal Reflux Disease" : "Tests are often not necessary to confirm a diagnosis of GERD. A doctor will usually be able to identify the condition from a description of the symptoms being experienced. Tests, however, may be necessary if the symptoms are severe and/or other more serious conditions are suspected. ",
        "Genital Herpes" : "The diagnosis is usually based on symptoms and the appearance of herpes blisters. Testing fluid from the blister for the herpes simplex virus can confirm the diagnosis. ",
        "Neonatal Jaundice" : "Babies are checked for neonatal jaundice as part of the routine medical examination which typically takes place within 72 hours of birth. As the condition can take up to one week to appear, the baby should also be checked frequently after being taken home. Parents should monitor for yellowing of the skin and eyes, as well as for bright yellow urine and abnormally pale stool. If jaundice is suspected, parents should contact a doctor or midwife who will then usually recommend a bilirubin test."
    }
    },
    {"question_type" : "treatment",
    "patterns" : ["How to treat it?","What are the treatments","What are my treatment options?","Which treatment is most common for my disease or condition?","Are there any treatments","How to deal with it"],
    "responses" : {
        "Abdominal Pain" : "As a rule of thumb for abdominal pain self-care: If it feels good, it is good. Conversely, this implies: If it feels uncomfortable, it should be avoided. Many people report, that some of these measures can help ease the pain: Calming teas, such as chamomile, aniseed, cumin or fennel, Warmth, for example through a hot-water bottle or a cherry pit pillow, light exercise like a walk, Plenty of rest, avoiding stress, plenty of fluids, especially if there is diarrhea, soft clockwise belly massages and a relaxing atmosphere, for example through calming music.",
        "Achilles Tendonitis" : "Treatment is usually simple and mainly involves resting from the specific exercises that cause the pain. This will often be supplemented by regenerative/rehabilitative stretching exercises, most often tailored to the person and taught by a physical therapist. Most people recover from Achilles tendonitis without any lasting effects.",
        "Acute Aspiration of Oropharyngeal or Gastric Contents" : "Treatment depends on the severity of the aspiration. The aspirated objects or objects may need to removed by using a flexible camera to look at the windpipes. If pneumonia occurs, antibiotics might be given. In severe cases, the aspiration may cause severe damage to the lungs, and a machine to help with breathing (a ventilator) might be necessary to support breathing while the lungs recover.",
        "Acute Bronchitis" : "In many cases, the condition will require no treatment and will clear up of its own accord in two to three weeks. If it is particularly severe, if it lasts for longer than 10 to 14 days, or if a bacterial cause is suspected, however, treatment methods are available. These include: Cough medicine, pain relievers such as ibuprofen and acetaminophen (paracetamol), antibiotic medications... ",
        "Acute Gastritis" : "Treatment for acute gastritis depends on the underlying cause. Making the correct diagnosis and treating the condition accordingly is essential in order to avoid the gastritis becoming chronic.",
        "Acute Heart Failure" : "Treatment typically involves supporting breathing and adjusting the blood pressure and, where necessary, removing excess fluid from the body. There is no cure, but long-term treatment involving medications and rehabilitation can improve the heart's function. ",
        "Acute HIV Infection" : "Acute HIV infection is treated with antiretroviral drugs (ARVs), which are drugs specially designed to treat retroviruses. People with HIV are prescribed a combination of antiretroviral drugs, which together are known as antiretroviral therapy (ART). ",
        "Acute Laryngitis" : "Treatment depends on the source of the problem, but mainly involves resting the larynx, by not overusing the voice while hoarseness is present,.Drinking warm liquids and using medicated throat lozenges may be useful to soothe the throat. Home remedies such as adding ginger or tumeric to warm drinks can help fight causal infections. Simple pain medications (ibuprofen or paracetamol) can help with the pain. If the condition is caused by bacteria, the treatment may involve antibiotics. ",
        "Acute Otitis Media" : "The main treatment of middle ear infections is pain relief. Warm compresses or pain medication (such as ibuprofen and paracetamol) are both helpful for managing ear pain. Antibiotics are often not needed to treat middle ear infections, but may be offered to people with complicated ear infections or other medical issues. ",
        "Acute Pancreatitis" : "People with acute pancreatitis are usually admitted to hospital. Treatment generally includes: Fluids administered intravenously, painkillers, drugs to reduce nausea and vomiting, feeding by tube or intravenously if the person cannot eat and Antibiotics if the person has an infection in the pancreas. ",
        "Acute Panic Attack" : "If one's doctor diagnoses a mental health condition, such as panic disorder or another form of anxiety disorder, as a result of one's consultation about panic attack(s), then an appropriate treatment plan will be devised. This will usually involve psychotherapy and/or medication, tailored to the needs of the individual and to managing their diagnosed condition(s). ",
        "Acute Pharyngitis" : "Most cases of pharyngitis will go away without treatment in a week or less. Antibiotics are not helpful in cases of pharyngitis caused by viral infections, and are only used in cases where a bacterial infection is lingering. Most treatment for pharyngitis can be carried out at home, using over-the-counter products.",
        "Acute Pyelonephritis" : "Most people affected by acute pyelonephritis are successfully treated with antibiotics and do not need to be hospitalised. However, in cases of very severe and/or complicated infections, hospitalisation may be safest in order to monitor the infection consistently and to control its spread most effectively. Hospitalisation can be avoided if treatment is sought early on in the course of the infection. ",
        "Acute Stress Disorder" : "Many people with ASD recover without any treatment. However, effective treatment options are available and may be recommended in cases where symptoms are severe or persistent. Treatment, which is primarily psychotherapy, sometimes combined with short-term use of medication, is aimed at alleviating symptoms and reducing the risk of the person subsequently developing PTSD. ",
        "Acute Varicella Zoster (Chickenpox)" : "Generally, no specific treatment is recommended for children with chickenpox. Lotions, such as calamine lotion, to help reduce itching might be helpful, while adults can also use antihistamine tablets. Oatmeal baths and wet compresses may also help relieve the itching. Pain and fever should be managed with paracetamol. ",
        "Allergic Conjunctivitis" : "Many cases of mild allergic conjunctivitis clear up on their own, without specific treatment, when contact with the causal allergen is minimized or avoided. Applying cool compresses to the eyes and using lubricating eye drops, also known as artificial tears, which are available over the counter, may help to relieve symptoms. However, allergy medications, such as antihistamine tablets and prescription eye drops, may be recommended, particularly for more severe cases of allergic conjunctivitis. ",
        "Allergic Rhinitis" : "There is no cure for allergic rhinitis, but the effects of the condition can be lessened with the use of nasal sprays and antihistamine medications. A doctor may recommend immunotherapy - a treatment option that can provide long-term relief. Steps can also be taken to avoid allergens. The severity of allergic rhinitis can also change over the course of an affected person's life. This means, for example, that the effects of allergic rhinitis may fade during puberty, or that an affected person may develop a sensitivity to new allergens during adulthood. ",
        "Alzheimer's Disease" : "Alzheimer's disease cannot be cured. However, a person may experience some relief from their symptoms after taking medication such as cholinesterase inhibitors. Treatment for Alzheimer's is focused on suppressing symptoms and maintaining brain function for as long as possible. Therapy is also often recommended to help a person come to terms with the loss of their mental function. ",
        "Amyotrophic Lateral Sclerosis (ALS)" : "There is no treatment to cure ALS, though there are some medications that slow down the destruction of the nerve cells. Management of this condition aims to relieve the symptoms of ALS/MND and support the person and their family. ",
        "Anal Cancer" : "Treatment depends on the type of anal cancer and stage of diagnosis, but typically involves a combination of surgery and chemotherapy. Recovery rates tend to be better in cases where the cancer is diagnosed early. ",
        "Anal Fissure" : "Anal fissure treatment generally involves softening the stool, avoiding constipation where possible and practicing good hygiene. Anal fissures typically heal within six weeks. An anal fissure that lasts for more than six weeks is called a chronic anal fissure. Occasionally, surgery is required to repair the tear. ",
        "Anaphylaxis" : "Anaphylaxis is a life-threatening emergency and needs immediate treatment. If it is suspected that a person is experiencing anaphylaxis then an ambulance must be called at once and the person transported to the nearest emergency department. People at high risk are recommended to carry around an emergency anaphylaxis kit with an adrenaline injection pen, especially when traveling to areas where medical help is not readily available. If treated quickly and appropriately, most people recover well after an episode of anaphylaxis. ",
        "Anemia" : "The treatment recommended for anemia depends on the underlying cause. In cases of iron or vitamin deficiency, treatment will typically involve dietary changes and sometimes the use of supplements or medications. In less common types of anemia, as well as severe cases, more complex approaches, such as blood transfusions, may be needed.",
        "Aortic Dissection" : "A type A aortic dissection is a medical emergency requiring surgery to repair the damaged aorta before complications can occur. A type B aortic dissection may not necessarily require surgery. Medication, such as beta blockers - these may be used to manage blood pressure - or a less invasive type of surgery, elective endovascular repair, may be performed to redirect blood flow away from the dissection. After initial treatment for both types of aortic dissection has been carried out, long-term use of blood pressure-lowering medication will typically be required. ",
        "Aphthous Mouth Ulcers" : "There is no cure for aphthous ulcers, aphthae or canker sores, but there are ways to manage the symptoms. In the majority of cases, the ulcers will disappear without treatment and avoiding hard or irritative foods, applying cold substances to the affected area and if needed using numbing preparations, like topical lidocaine or benzocaine will be enough to manage the pain. When further treatment is required, there are several possible options, with the chosen route depending on a doctor's judgement of how well each may work, based on the location and severity of the ulceration, and the affected person's general health. ",
        "Arthritis" : "It is always important to seek prompt diagnosis and treatment of arthritis, as well as any other associated conditions. Early intervention helps to prevent joint damage, which can lead to physical disability. Arthritis treatment will vary, depending on the type of arthritis, but generally may include: Rest, exercise, medication, occupational or physical therapy and in some cases surgery.",
        "Asperger Syndrome" : "Treatment for any type of autism depends on the specific symptoms, needs and circumstances of the person with the condition. A number of therapies may be able to minimize symptoms and help the person to function in daily life. Recommended therapies may include: Early interventions for children, behavioral therapy and skills training. ",
        "Asthma" :"Reliever inhalers usually blue are taken to relieve asthma symptoms quickly. The inhaler usually contains a medicine called a short-acting beta2-agonist, which works by relaxing the muscles surrounding the narrowed airways. This allows the airways to open wider, making it easier to breathe again. Reliever inhalers do not reduce the inflammation in the airways, so they do not make asthma better in the long term, they are intended only for the relief of symptoms.",
        "Atherosclerosis" : "At present, no treatment exists to reverse atherosclerosis. However, there are a variety of ways to slow the progress of the condition and reduce the risk of complications, such as heart attack and stroke. ",
        "Atopic Dermatitis" : "There is no cure for atopic dermatitis, meaning treatment is aimed at managing the symptoms. In many cases, symptoms will naturally improve with age. The two main treatment methods for atopic dermatitis are: Emollients or moisturizers and Steroid creams and ointments (topical steroids). Treatment for atopic dermatitis aims to reduce the number and severity of flare-ups by reducing skin irritation and promoting skin health. ",
        "Bacterial Conjunctivitis" : "Many cases of mild bacterial conjunctivitis clear up on their own, within a week or two and without any specific treatment. Cleaning the eyes throughout the day with water and a clean cloth or sterile pad, and using lubricating eye drops, also known as artificial tears, may help to relieve symptoms. However, antibiotic eye drops or ointments may be recommended, particularly for more severe cases of bacterial conjunctivitis. ",
        "Bacterial Gastroenteritis" : "While it can be very unpleasant, most cases of bacterial gastroenteritis can be treated at home, and clear up within a few days without causing complications. Treatment for bacterial gastroenteritis typically involves: Resting at home, drinking plenty of fluids to avoid dehydration and when necessary, taking medication to relieve nausea and diarrhea. Antibiotics are generally only recommended for more severe types of bacterial gastroenteritis. ",
        "Bacterial Meningitis" : "Bacterial meningitis is a serious condition and requires urgent medical care. The infection is treated with intravenous (IV) antibiotics, i.e. through a drip. People with bacterial meningitis are often very sick and may need other supportive treatment, such as fluids to increase blood pressure while the antibiotics work to fight the infection. Most people with suspected bacterial meningitis will also be isolated after being admitted to hospital. ",
        "Bacterial Prostatitis" : "Bacterial prostatitis is treated with antibiotics. These are usually taken for 2-4 weeks. If the infection becomes persistent, longer courses of antibiotics or antibiotics through a drip (intravenous) may be needed. Pain can be managed with simple pain-relieving medication (paracetamol or ibuprofen). A urinary catheter (a tube) might be needed in case urination is difficult and very painful. ",
        "Bacterial Sinusitis" : "Most cases of bacterial sinusitis will get better without antibiotics, usually within 14 days. Because of this, and because bacterial sinusitis is often caused by bacteria that are to some degree resistant to antibiotics, most doctors prefer that affected people initially try to manage the condition using home remedies and over the counter medications. Antibiotics are usually only prescribed for people who have severe or ongoing symptoms, or whose infection may be complicated by various other medical factors. Viral sinusitis does not respond to antibiotic treatment. ",
        "Benign Paroxysmal Positional Vertigo" : "This form of dizziness can be treated with certain repositioning maneuvers (Epley maneuvers or Brandt-Daroff exercises). During these series of controlled exercises, symptoms may get worse. After being instructed by the doctor in how to do them, people can do some of these exercises at home. Normally BPPV can be treated well in this manner. Medication is not used to treat BPPV, though might be helpful in managing nausea associated with the dizziness. In severe persistent cases surgery may be an option. ",
        "Benign Prostatic Hyperplasia" : "A variety of treatment options for BPH exist, including: Medication, Minimally invasive therapy and surgery. The treatment route chosen will depend on: The severity of the condition, age, general health and the size of the prostate. ",
        "Bladder Cancer" : "The treatment required depends on the exact type of bladder cancer and the extent to which it has spread. Treatments usually differ significantly between non-muscle-invasive bladder cancer and muscle-invasive bladder cancer. Treatment options for bladder cancer also depend on the overall health of the affected person. The treating doctor can give the best advice as to treatment. ",
        "Breast Cancer" : "If diagnosed early, surgery to remove the tissue affected by breast cancer in its entirety, along with local radiation therapy, may cure a person of this condition. If diagnosed at a later stage, when the breast cancer has spread, treatments that affect the whole body, such as chemotherapy, are often necessary. ",
        "Burnout" : "There is not a single method for treating burnout, but affected people may cope better with stress by adjusting their attitude (rediscovering enjoyable aspects of work, reevaluating priorities and goals), resting (taking short breaks throughout the day, sleeping more), and taking time to recharge themselves outside of work (spending time doing enjoyable things outside of work, seeking support from family and friends, exercising, etc.). ",
        "Candida Vulvovaginitis" : "Treatment will typically involve the use of antifungal medication, which will usually take the form of an oral tablet and/or topical skin cream. Following treatment, most cases of thrush will resolve in a few days. If symptoms do not disappear in this timeframe, a doctor should be consulted. ",
        "Cataracts" : "Cataracts surgery is a common procedure and usually carried out under local anaesthetic. Most people who undergo cataract surgery will see a significant improvement in their vision, with 9 out of 10 people achieving between 20/20 and 20/40 vision afterwards. However, most surgeons will focus on correcting long-distance sight, meaning glasses may still be needed to see things close at hand. ",
        "Celiac Disease" : "There is currently no cure for celiac disease, treatment requires adopting a completely gluten-free diet. In addition, certain supplements and vaccinations may be recommended to help prevent complications from celiac disease. ",
        "Cervical Cancer" : "Depending on the stage, cervical cancer can be treated by radiotherapy, surgery and chemotherapy or a combination of therapies. The treating doctor can give the best advice as to treatment. ",
        "Cervicitis" : "There is no specific treatment for cervicitis. Instead, a doctor will recommend a treatment method based on the root cause of the condition, as well as the affected person’s symptoms, age, overall health and medical history. Antibiotics or antiviral medications may be necessary to treat infectious cervicitis, however most people recover fully from the condition. ",
        "Chest Cold" : "A chest cold does not require treatment in all cases, it will normally begin to fade in two to three weeks, though the cough may persist for longer. If the coughing is particularly severe, cough medication is available over the counter, or it may be prescribed by a doctor. Pain relievers such as ibuprofen and paracetamol can be taken to suppress pain.  ",
        "Cholecystitis" : "Treatment, which often requires going to a hospital, may initially involve pain-relief measures, fluids and antibiotics. In most cases, the gallbladder will need to be removed in a surgical procedure called a cholecystectomy. With appropriate treatment, the outlook for uncomplicated cases of cholecystitis is generally very good, and most people recover well. ",
        "Chronic Heart Failure" : "Once diagnosed, people with chronic heart failure will work closely with their doctors to create a treatment plan that works for them. In most cases, this plan will include a variety of lifestyle and dietary changes, as well as medications. ",
        "Chronic Idiopathic Constipation" : "As it is not possible to determine the cause of CIC, the treatment options tend to be limited. Dietary changes, like increasing dietary fiber and water intake are usually helpful, as is doing regular physical exercise. However, diet, fluid intake and exercise are not uniformly effective, and some people with CIC may be recommended to use: Fibre supplements, Osmotic laxatives  or Stimulant laxatives. ",
        "Chronic Laryngitis" : "Treatment for long-lasting laryngitis depends on the source of the issue. If the laryngitis is caused by gastric reflux, that underlying condition should be treated. If the inflammation is caused by a bacterial infection, antibiotic medications are normally taken. Aside from addressing the root cause with appropriate medications and/or therapies, treatment for persistent laryngitis mainly involves resting the voice and soothing the throat, to give the larynx and vocal cords a chance to heal. ",
        "Chronic Pancreatitis" : "Treatment for chronic pancreatitis involves painkillers and fluids, usually given intravenously during hospitalization. Complications arising from this condition can be managed with enzyme and nutritional supplements as well as surgery. ",
        "Chronic Pelvic Pain" : "There is no single way of treating chronic pelvic pain. Treatment will be tailored to the individual and depend on the underlying cause of the condition, its severity and its frequency, and will often involve a number of different methods such as Pain relief medication, Physical therapy, Surgery and Counseling. ",
        "Chronic Renal Failure" : "Treatment consists of managing the underlying condition and supporting kidney function. Chronic renal failure requires careful, lifelong management, and can progress to end-stage kidney failure which requires dialysis or transplant. However, many cases of chronic renal failure are mild to moderate and can be managed by patients with support from a doctor. ",
        "Cluster Headaches (CHs)" : "Although CHs are incredibly painful, they are not life-threatening, and treatment can reduce the frequency and severity of the headaches. In the short-term, treatment for cluster headaches focuses on lessening the symptoms of the headache attack. This usually involves specialized painkillers and/or oxygen therapy, i.e.inhaling pure oxygen through a face mask. Long-term treatment of CHs focuses on lifestyle changes and prevention. ",
        "Cold Sores (Herpes Labialis)" : "If the symptoms are rare, fairly mild, and the current outbreak is already in one of the later stages, treatment may not be necessary. The available drugs counteract the spreading of the virus. For this reason, treatment with so-called antiviral medication is much more effective if it is started early, even before the virus has been able to multiply and before a blister has formed. ",
        "Colorectal Cancer" : "Surgery is normally the only way to cure colorectal cancer. However, depending on how developed the cancer is, surgery may no longer be an option for some people. In those cases, medication can be used to manage symptoms and attempt to prolong a person's life. ",
        "Common Cold" : "A cold will typically remedy itself in up to 10 days. During this time, the symptoms of a cold can be managed through a combination of self-care techniques and over-the-counter medications. These methods, however, will not shorten the duration of the cold. ",
        "Concussion Syndrome" : "There is no specific treatment for this condition. People who have had a concussion should rest until their symptoms have settled. Paracetamol may be helpful for headache. Athletes who have had a concussion should get advice from a doctor before returning to contact sports. ",
        "Conversion Disorder" : "Treatments that can be recommended for conversion disorder include: Psychotherapy; such as cognitive behavior therapy (CBT) or counselling, Hypnosis, Physical therapy and Occupational therapy. Practicing stress-relieving techniques, such as regular light exercise and enjoyable activities, such as gardening, can be helpful in preventing the symptoms of conversion disorder. ",
        "Costochondritis" : "The main aim of the treatment is to relieve pain. Treatment of costochondritis often involves: Rest and physical therapy, Avoiding activities that worsen the pain, Doing stretching exercises, Simple painkillers, Antibiotics and corticosteroid injections. ",
        "COVID-19 (coronavirus disease 2019)" : "To date, there is no specific medicine recommended to treat the novel coronavirus. However, those infected with COVID-19 should receive appropriate care to relieve and treat symptoms, and those with severe illness should receive optimal supportive care. Some specific treatments are under investigation and will be tested through clinical trials. ",
        "Crohn's Disease" : "Treatment for Crohn's disease aims to alleviate the symptoms and prolong periods of remission. With effective treatment, many people with Crohn's disease will experience significant periods, possibly several years, without symptoms. For people with more severe forms of the condition, and for whom medications do not provide significant relief from the symptoms, surgery may be required. ",
        "Cushing's Syndrome" : "The treatment depends on the cause of the high cortisol level. If it is caused by a high intake of cortisol, the dosage of the medication should be reduced slowly. People taking steroid medications should never stop these medications suddenly. If a growth is the underlying reason, then it may have to be removed by surgery. If it is not safe to remove the cause of the high cortisol levels, cortisol can be blocked by other medications. ",
        "Dementia With Lewy Bodies" : "There is no cure for Lewy body dementia but it is possible to learn to manage symptoms. It is helpful to get the ongoing advice of a doctor, nurse, occupational therapist and physiotherapist, all of whom can help develop strategies to ease some of the everyday difficulties of living with Lewy body dementia, such as difficulties with memory, confusion, eating, dressing, etc. Medications may be prescribed to help to improve the thinking and memory, to help with tremors and stiffness, or to improve sleep. ",
        "Dental Abscess" : "Treatment for dental abscesses involves draining the pus from the tooth and filling or removing the tooth to prevent re-infection. ",
        "Diabetes" : "There is no cure for diabetes, meaning treatment is aimed at managing blood glucose levels and controlling the symptoms and possible complications of the condition. In the majority of cases, diabetes can be successfully managed. ",
        "Disseminated Tuberculosis" : "The treatment of disseminated tuberculosis usually involves taking a combination of antibiotics for 6 to 12 months. Most people recover well, although it does take time for the symptoms to improve. ",
        "Diverticulitis" : "Treatment is based on the severity and stage of diverticular disease. Affected people with no symptoms usually do not need treatment. People who have diverticulitis (infection and inflammation of the pouches) may receive antibiotics to treat the infection. In severe or complicated cases, surgery might be needed to stop bleeding, drain pus, or even remove parts of the bowel. However this is very uncommon. ",
        "Early Disseminated Lyme Disease" : "Lyme disease is treated with antibiotics. Simple pain relief, such as paracetamol or ibuprofen, might be helpful for sore muscles and joints. Close monitoring of the success of the therapy is obligatory. ",
        "Ebola Virus Disease" : "There is not currently a cure or licensed vaccine for the Ebola Virus. Medical care is necessary to prevent dehydration and to maintain vital functions (especially blood pressure). Blood transfusions are often necessary to replace losses from bleeding. ",
        "Endocarditis" : "Many cases of (infective) endocarditis can be effectively treated with antibiotics or antifungal medication. If the growth is very large, or if there is new or pre-existing damage to the heart, surgery may be required. ",
        "Endometrial Cancer" : "Treatment of uterine cancer depends on the size of the cancer, the exact type of cancer and whether the cancer has spread. The combination of these factors determines the stage of the cancer. Depending on the stage, endometrial cancer can be treated by radiation therapy, surgery to remove the uterus, chemotherapy, or a combination of therapies. ",
        "Endometrial Polyps" : "A short-term option to address the symptoms of endometrial polyps is the use of hormonal treatments, such as gonadotropin-releasing hormone agonists and progestins. Another option is Uterine polyp removal, called a polypectomy, which is carried out using a hysteroscopy, is the standard procedure. ",
        "Epstein-Barr Virus" : "Treatment for infectious mononucleosis centers around relieving the symptoms. Medications such as aciclovir have not been shown to be effective against glandular fever.",
        "Esophageal Cancer" : "Depending on the stage, esophageal cancer can be treated by radiotherapy, surgical removal of some or all of the esophagus, and chemotherapy or a combination of therapies. ",
        "Essential Tremor" : "There is no cure for Fabry disease so treatment is centered on managing the symptoms of the disorder. This can be combined with enzyme replacement therapy, which has demonstrated some success in combating the enzyme deficiency and should be started as soon as a diagnosis is made.",
        "Fibromyalgia" : "Treatment of fibromyalgia can be difficult because the cause is not well understood. Physical therapy and exercise programs are very effective in reducing pain and muscle stiffness for people with fibromyalgia. Some people also find stress-relieving activities helpful. Simple pain relief, such as paracetamol, may provide some relief, as may using hot packs or massage. ",
        "Folate Deficiency" : "Folate deficiency will not go away on its own. Treatment is required and may involve dietary changes and/or oral supplements and treatment of underlying causes, if any are present.  ",
        "Functional Dyspepsia" : "Functional dyspepsia cannot be fully cured, but its symptoms can be successfully managed through lifestyle changes, medication, or a combination of the two. ",
        "Gallstones (Symptomatic Cholelithiasis)" : "In general, gallstones are usually only treated if they cause discomfort. Treatment depends on the individual case and may be: Surgery to remove gallstones, Endoscopic retrograde cholangiopancreatography (ERCP), Medications containing bile acid or Extracorporeal shock wave lithotripsy (ESWL). ",
        "Gastroenteritis" : "In most cases of viral and bacterial gastroenteritis, basic supportive treatment is sufficient. This includes magaining the nausea, vomiting and diarrhea through: Bed rest, Oral rehydration and medication. As long as there are no indications of a more serious condition or severe dehydration, gastroenteritis can generally be treated at home.",
        "Gastroesophageal Reflux Disease" : "The treatment method used for gastroesophageal reflux disease will depend on the severity of the condition. Mild cases will usually be treated with diet and lifestyle changes, for example, losing weight, quitting smoking and/or reducing alcohol intake, and by taking medications to reduce stomach acidity. ",
        "Genital Herpes" : "In mild cases, where there are few blisters and the affected person is otherwise well, treatment may consist of antiviral creams. Tablets are also available to help prevent or reduce the symptoms of an outbreak of blisters. Severe or complicated cases need antiviral medication intravenously, i.e. through a drip.  ",
        "Neonatal Jaundice" : "Treatment for neonatal jaundice is aimed at reducing the levels of bilirubin in the blood. In mild cases, no treatment at all may be required other than monitoring the child, making sure that the jaundice improves. In other cases, treatment may be necessary and options include: Phototherapy, intravenous immunoglobulins and exchange transfusion."
    }
    }
    
      
    
    
    
]}